In [17]:
#%pip install mysql-connector-python
#%pip install pymysql
import mysql.connector as conn
import pandas as pd
from sqlalchemy import create_engine

In [13]:
conexion = conn.connect(host='localhost',  
                       user='root',        
                       passwd='password', 
                       )

cursor = conexion.cursor()

In [14]:
str_conn = 'mysql+pymysql://root:password@localhost:3306/movies'

cursor = create_engine(str_conn)

In [15]:
query = '''
SELECT f.title AS pelicula_mas_rentada, COUNT(rental_id) AS veces_rentada
FROM film f
INNER JOIN inventory i ON f.film_id = i.film_id
INNER JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.title
ORDER BY veces_rentada DESC
;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  pelicula_mas_rentada  veces_rentada
0        BOOGIE AMELIE              4
1          CLOSER BANG              3
2       BINGO TALENTED              3
3   BUCKET BROTHERHOOD              3
4          ANTHEM LUKE              3

In [16]:
query = '''

SELECT day_of_week, COUNT(*) AS total_rentals   
FROM rental
GROUP BY day_of_week
ORDER BY total_rentals DESC

;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  day_of_week  total_rentals
0    Saturday            196
1    Thursday            174
2      Friday            166
3      Monday            158
4      Sunday            154

In [18]:
query = '''
SELECT rating, COUNT(*) AS total_vistas
FROM film
GROUP BY rating
ORDER BY total_vistas DESC
;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  rating  total_vistas
0  PG-13           223
1  NC-17           210
2      R           195
3     PG           194
4      G           178